STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_common.h
/**
  **********************************************************************************************************************
  * @file    stm32_adv_lpbam_common.h
  * @author  MCD Application Team
  * @brief   header for the stm32_adv_lpbam_common.c file
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32_ADV_LPBAM_COMMON_H
#define STM32_ADV_LPBAM_COMMON_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_platform_lpbam_common.h"

/** @addtogroup LPBAM_Utilities_Driver
  * @{
  */

/** @defgroup COMMON_Advanced COMMON_Advanced
  * @brief    COMMON Advanced LPBAM module driver
  * @{
  */
/** @defgroup LPBAM_COMMON_Advanced_Exported_Types LPBAM COMMON Advanced Exported Types
  * @brief    LPBAM COMMON Advanced Exported Types
  * @{
  */
/**
  * @brief LPBAM COMMON Transfer Configuration Structure definition.
  */
typedef struct
{
  LPBAM_DMA_NodeConfTypeDef TransferConfig;      /*!< Specifies the transfer configuration parameters.                */

  LPBAM_FunctionalState UpdateSrcInc;            /*!< Specifies whether the data source increment to be updated or not.
                                                      This parameter can be ENABLE or DISABLE
                                                      When this field is enabled, configuring SrcInc in TransferConfig
                                                      is mandatory                                                    */
  LPBAM_FunctionalState UpdateDestInc;           /*!< Specifies whether the data destination increment to be updated
                                                      or not.
                                                      This parameter can be ENABLE or DISABLE
                                                      When this field is enabled, configuring DestInc in
                                                      TransferConfig is mandatory                                     */
  LPBAM_FunctionalState UpdateSrcDataWidth;      /*!< Specifies whether the data source data width to be updated or
                                                      not.
                                                      This parameter can be ENABLE or DISABLE
                                                      When this field is enabled, configuring SrcDataWidth in
                                                      TransferConfig is mandatory                                     */
  LPBAM_FunctionalState UpdateDestDataWidth;     /*!< Specifies whether the destination data width to be updated or
                                                      not.
                                                      This parameter can be ENABLE or DISABLE
                                                      When this field is enabled, configuring DestDataWidth in
                                                      TransferConfig is mandatory                                     */
  LPBAM_FunctionalState UpdateTransferEventMode; /*!< Specifies whether the transfer event mode to be updated or not.
                                                      This parameter can be ENABLE or DISABLE
                                                      When this field is enabled, configuring TransferEventMode in
                                                      TransferConfig is mandatory                                     */
#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
  LPBAM_FunctionalState UpdateSrcSecure;         /*!< Specifies whether the source security to be updated or not.
                                                      This parameter can be ENABLE or DISABLE
                                                      When this field is enabled, configuring SrcSecure in
                                                      TransferConfig is mandatory                                     */
  LPBAM_FunctionalState UpdateDestSecure;        /*!< Specifies whether the destination security to be updated or not.
                                                      This parameter can be ENABLE or DISABLE
                                                      When this field is enabled, configuring DestSecure in
                                                      TransferConfig is mandatory                                     */
#endif /* defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

} LPBAM_COMMON_DataAdvConf_t;

/**
  * @brief LPBAM COMMON Trigger Configuration Structure definition.
  */
typedef struct
{
  LPBAM_DMA_TriggerConfTypeDef TriggerConfig; /*!< Specifies the transfer trigger parameters. */

} LPBAM_COMMON_TrigAdvConf_t;
/**
  * @}
  */

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup LPBAM_COMMON_Advanced_Exported_Constants LPBAM COMMON Advanced Exported Constants
  * @brief    LPBAM COMMON Advanced Exported Constants.
  * @{
  */

/** @addtogroup LPBAM_Q_Config_Node_Selection LPBAM Q Configuration Node Selection
  * @{
  */
/* ADC configuration nodes defines */
#define LPBAM_ADC_CONVERSION_CONFIGQ_CONFIG_NODE  (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_ADC_Conversion_SetConfigQ().
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_ADC_CONVERSION_DATAQ_CONFIG_NODE    (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_ADC_Conversion_SetDataQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_ADC_CONVERSION_FULLQ_CONFIG_NODE    (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_ADC_Conversion_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_ADC_ANALOGWDG_FULLQ_CONFIG_NODE     (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_ADC_AnalogWDGConfig_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */

/* COMP configuration nodes defines */
#define LPBAM_COMP_START_FULLQ_CONFIG_NODE        (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_COMP_Start_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */

/* DAC configuration nodes defines */
#define LPBAM_DAC_CONVERSION_CONFIGQ_CONFIG_NODE  (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_DAC_Conversion_SetConfigQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_DAC_CONVERSION_DATAQ_CONFIG_NODE    (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_DAC_Conversion_SetDataQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_DAC_CONVERSION_FULLQ_CONFIG_NODE    (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_DAC_Conversion_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */

/* DMA configuration nodes defines */
#define LPBAM_DMA_START_FULLQ_CONFIG_NODE         (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_DMA_Start_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */

/* I2C configuration nodes defines */
#define LPBAM_I2C_MASTERTX_CONFIGQ_CONFIG_NODE    (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_I2C_MasterTransmit_SetConfigQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_I2C_MASTERTX_DATAQ_CONFIG_NODE      (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_I2C_MasterTransmit_SetDataQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_I2C_MASTERTX_FULLQ_CONFIG_NODE      (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_I2C_MasterTransmit_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_I2C_SLAVETX_CONFIGQ_CONFIG_NODE     (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_I2C_SlaveTransmit_SetConfigQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_I2C_SLAVETX_DATAQ_CONFIG_NODE       (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_I2C_SlaveTransmit_SetDataQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_I2C_SLAVETX_FULLQ_CONFIG_NODE       (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_I2C_SlaveTransmit_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_I2C_MASTERRX_CONFIGQ_CONFIG_NODE    (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_I2C_MasterReceive_SetConfigQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_I2C_MASTERRX_DATAQ_CONFIG_NODE      (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_I2C_MasterReceive_SetDataQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_I2C_MASTERRX_FULLQ_CONFIG_NODE      (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_I2C_MasterReceive_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_I2C_SLAVERX_CONFIGQ_CONFIG_NODE     (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_I2C_SlaveReceive_SetConfigQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_I2C_SLAVERX_DATAQ_CONFIG_NODE       (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_I2C_SlaveReceive_SetDataQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_I2C_SLAVERX_FULLQ_CONFIG_NODE       (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_I2C_SlaveReceive_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */

