STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_common.h
/* LPTIM configuration nodes defines */
#define LPBAM_LPTIM_PWM_FULLQ_CONFIG_NODE         (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_LPTIM_PWM_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_LPTIM_CM_FULLQ_CONFIG_NODE          (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_LPTIM_CM_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_LPTIM_START_FULLQ_CONFIG_NODE       (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_LPTIM_Start_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_LPTIM_STOP_FULLQ_CONFIG_NODE        (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_LPTIM_Stop_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */

/* OPAMP configuration nodes defines */
#define LPBAM_OPAMP_START_FULLQ_CONFIG_NODE       (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_OPAMP_Start_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */

/* SPI configuration nodes defines */
#define LPBAM_SPI_TX_CONFIGQ_CONFIG_NODE          (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_SPI_Transmit_SetConfigQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_SPI_TX_DATAQ_CONFIG_NODE            (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_SPI_Transmit_SetDataQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_SPI_TX_FULLQ_CONFIG_NODE            (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_SPI_Transmit_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_SPI_RX_CONFIGQ_CONFIG_NODE          (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_SPI_Receive_SetConfigQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_SPI_RX_DATAQ_CONFIG_NODE            (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_SPI_Receive_SetDataQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_SPI_RX_FULLQ_CONFIG_NODE            (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_SPI_Receive_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_SPI_TXRX_CONFIGQ_CONFIG_NODE        (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_SPI_TransmitReceive_SetConfigQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_SPI_TXRX_DATAQ_CONFIG_NODE          (0x00U) /*!< Specifies the config nodes of the queues built by
                                                               ADV_LPBAM_SPI_TransmitReceive_SetDataQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig() : to
                                                                           be applied only for TX queue.
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_SPI_TXRX_FULLQ_CONFIG_NODE          (0x00U) /*!< Specifies the config nodes of the queues built by
                                                               ADV_LPBAM_SPI_TransmitReceive_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig() : to
                                                                           be applied only for TX queue.
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */

/* UART configuration nodes defines */
#define LPBAM_UART_TX_CONFIGQ_CONFIG_NODE         (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_UART_Transmit_SetConfigQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_UART_TX_DATAQ_CONFIG_NODE           (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_UART_Transmit_SetDataQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_UART_TX_FULLQ_CONFIG_NODE           (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_UART_Transmit_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_UART_RX_CONFIGQ_CONFIG_NODE         (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_UART_Receive_SetConfigQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_UART_RX_DATAQ_CONFIG_NODE           (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_UART_Receive_SetDataQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
#define LPBAM_UART_RX_FULLQ_CONFIG_NODE           (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_UART_Receive_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */

/* VREFBUF configuration nodes defines */
#define LPBAM_VREFBUF_BUFMODE_CONFIGQ_CONFIG_NODE (0x00U) /*!< Specifies the config node of the queue built by
                                                               ADV_LPBAM_VREFBUF_BufferMode_SetFullQ()
                                                               This define can be used as a parameter for :
                                                                         + ADV_LPBAM_Q_SetTriggerConfig()
                                                                         + ADV_LPBAM_Q_SetCircularMode()        */
/**
  * @}
  */

