STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_common.h
/** @addtogroup LPBAM_Q_Data_Node_Selection LPBAM Q Data Node Selection
  * @{
  */
/* ADC data nodes defines */
#define LPBAM_ADC_CONVERSION_DATAQ_DATA_NODE   (0x01U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_ADC_Conversion_SetDataQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetCircularMode()
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
#define LPBAM_ADC_CONVERSION_FULLQ_DATA_NODE   (0x0DU) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_ADC_Conversion_SetFullQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetCircularMode()
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
/* COMP data nodes defines */
#define LPBAM_COMP_OUTPUTLEVEL_FULLQ_DATA_NODE (0x00U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_COMP_OutputLevel_SetFullQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetTriggerConfig()
                                                                      + ADV_LPBAM_Q_SetCircularMode()
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
/* DAC data nodes defines */
#define LPBAM_DAC_CONVERSION_DATAQ_DATA_NODE   (0x00U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_DAC_Conversion_SetDataQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetCircularMode()
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
#define LPBAM_DAC_CONVERSION_FULLQ_DATA_NODE   (0x02U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_DAC_Conversion_SetFullQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetCircularMode()
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */

/* GPIO data nodes defines */
#define LPBAM_GPIO_WRITEPIN_FULLQ_DATA_NODE    (0x00U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_GPIO_WritePin_SetFullQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetTriggerConfig()
                                                                      + ADV_LPBAM_Q_SetCircularMode()
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
#define LPBAM_GPIO_WRITEPINSEQ_FULLQ_DATA_NODE (0x00U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_GPIO_WritePinSequence_SetFullQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetTriggerConfig()
                                                                      + ADV_LPBAM_Q_SetCircularMode()
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
#define LPBAM_GPIO_READPINSEQ_FULLQ_DATA_NODE  (0x00U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_GPIO_ReadPinSequence_SetFullQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetTriggerConfig()
                                                                      + ADV_LPBAM_Q_SetCircularMode()
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */

/* I2C data nodes defines */
#define LPBAM_I2C_MASTERTX_DATAQ_DATA_NODE     (0x01U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_I2C_MasterTransmit_SetDataQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
#define LPBAM_I2C_MASTERTX_FULLQ_DATA_NODE     (0x05U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_I2C_MasterTransmit_SetFullQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
#define LPBAM_I2C_SLAVETX_DATAQ_DATA_NODE      (0x01U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_I2C_SlaveTransmit_SetDataQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
#define LPBAM_I2C_SLAVETX_FULLQ_DATA_NODE      (0x04U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_I2C_SlaveTransmit_SetFullQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
#define LPBAM_I2C_MASTERRX_DATAQ_DATA_NODE     (0x01U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_I2C_MasterReceive_SetDataQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
#define LPBAM_I2C_MASTERRX_FULLQ_DATA_NODE     (0x05U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_I2C_MasterReceive_SetFullQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
#define LPBAM_I2C_SLAVERX_DATAQ_DATA_NODE      (0x01U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_I2C_SlaveReceive_SetDataQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
#define LPBAM_I2C_SLAVERX_FULLQ_DATA_NODE      (0x04U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_I2C_SlaveReceive_SetFullQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */

/* LPTIM data nodes defines */
#define LPBAM_LPTIM_IC_FULLQ_DATA_NODE         (0x00U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_LPTIM_IC_SetFullQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetCircularMode()
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */

/* SPI data nodes defines */
#define LPBAM_SPI_TX_DATAQ_DATA_NODE           (0x05U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_SPI_Transmit_SetDataQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
#define LPBAM_SPI_TX_FULLQ_DATA_NODE           (0x09U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_SPI_Transmit_SetFullQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
#define LPBAM_SPI_RX_DATAQ_DATA_NODE           (0x05U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_SPI_Receive_SetDataQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
#define LPBAM_SPI_RX_FULLQ_DATA_NODE           (0x09U) /*!< Specifies the data node of the queue built by
                                                            ADV_LPBAM_SPI_Receive_SetFullQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
#define LPBAM_SPI_TXRX_DATAQ_TXDATA_NODE       (0x05U) /*!< Specifies the data nodes of the queues built by
                                                            ADV_LPBAM_SPI_TransmitReceive_SetDataQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
#define LPBAM_SPI_TXRX_DATAQ_RXDATA_NODE       (0x00U) /*!< Specifies the data nodes of the queues built by
                                                            ADV_LPBAM_SPI_TransmitReceive_SetDataQ()
                                                            This define can be used as a parameter for :
                                                                      + ADV_LPBAM_Q_SetDataConfig()        */
#define LPBAM_SPI_TXRX_FULLQ_TXDATA_NODE       (0x09U) /*!< Specifies the data nodes of the queues built by
                                                            ADV_LPBAM_SPI_TransmitReceive_SetFullQ()
                                                            This define can be used as a parameter for :
                                                                    + ADV_LPBAM_Q_SetDataConfig()          */
#define LPBAM_SPI_TXRX_FULLQ_RXDATA_NODE       (0x00U) /*!< Specifies the data nodes of the queues built by
                                                            ADV_LPBAM_SPI_TransmitReceive_SetFullQ()
                                                            This define can be used as a parameter for :
                                                                    + ADV_LPBAM_Q_SetDataConfig()          */

/* UART data nodes defines */
#define LPBAM_UART_TX_DATAQ_DATA_NODE          (0x00U) /*!< Specifies the data node of the queue built by
                                                              ADV_LPBAM_UART_Transmit_SetDataQ()
                                                              This define can be used as a parameter for :
                                                                    + ADV_LPBAM_Q_SetCircularMode()
                                                                    + ADV_LPBAM_Q_SetDataConfig()          */
#define LPBAM_UART_TX_FULLQ_DATA_NODE          (0x04U) /*!< Specifies the data node of the queue built by
                                                              ADV_LPBAM_UART_Transmit_SetFullQ()
                                                              This define can be used as a parameter for :
                                                                    + ADV_LPBAM_Q_SetCircularMode()
                                                                    + ADV_LPBAM_Q_SetDataConfig()          */
#define LPBAM_UART_RX_DATAQ_DATA_NODE          (0x00U) /*!< Specifies the data node of the queue built by
                                                              ADV_LPBAM_UART_Receive_SetDataQ()
                                                              This define can be used as a parameter for :
                                                                    + ADV_LPBAM_Q_SetCircularMode()
                                                                    + ADV_LPBAM_Q_SetDataConfig()          */
#define LPBAM_UART_RX_FULLQ_DATA_NODE          (0x02U) /*!< Specifies the data node of the queue built by
                                                              ADV_LPBAM_UART_Receive_SetFullQ()
                                                              This define can be used as a parameter for :
                                                                    + ADV_LPBAM_Q_SetCircularMode()
                                                                    + ADV_LPBAM_Q_SetDataConfig()          */
/**
  * @}
  */

/**
  * @}
  */


/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup LPBAM_COMMON_Advanced_Exported_Functions LPBAM COMMON Advanced Exported Functions
  * @brief      LPBAM COMMON Advanced Exported Functions
  * @{
  */

/**
  * @brief ADV_LPBAM_Q_SetDataConfig.
  */
LPBAM_Status_t ADV_LPBAM_Q_SetDataConfig(LPBAM_COMMON_DataAdvConf_t const *const pDataConfig,
                                         uint32_t                   DataNode,
                                         void                       const *const pDescriptor);
/**
  * @brief ADV_LPBAM_Q_SetTriggerConfig.
  */
LPBAM_Status_t ADV_LPBAM_Q_SetTriggerConfig(LPBAM_COMMON_TrigAdvConf_t const *const pTrigConfig,
                                            uint32_t                   NodeLevel,
                                            void                       const *const pDescriptor);
/**
  * @brief ADV_LPBAM_Q_SetCircularMode.
  */
LPBAM_Status_t ADV_LPBAM_Q_SetCircularMode(void             const *const pDescriptor,
                                           uint32_t         NodeLevel,
                                           DMA_QListTypeDef *const pQueue);
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32_ADV_LPBAM_COMMON_H */
